/home/nikita/tensorflow/bin/python /home/nikita/.local/share/JetBrains/Toolbox/apps/PyCharm-P/ch-0/181.4668.75/helpers/pydev/pydev_run_in_console.py 45575 41125 /home/nikita/IdeaProjects/project/brainlearning/get_slice.py
Running /home/nikita/IdeaProjects/project/brainlearning/get_slice.py
import sys; print('Python %s on %s' % (sys.version, sys.platform))
sys.path.extend(['/home/nikita/IdeaProjects/project/brainlearning'])
Using TensorFlow backend.
Encoder Model
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
layer_1 (Layer)              (None, 320, 320, 1)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 160, 160, 64)      7808
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 160, 160, 64)      0
_________________________________________________________________
dropout_1 (Dropout)          (None, 160, 160, 64)      0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 80, 80, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 80, 80, 128)       204928
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 80, 80, 128)       0
_________________________________________________________________
dropout_2 (Dropout)          (None, 80, 80, 128)       0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 40, 40, 128)       0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 40, 40, 512)       590336
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 40, 40, 512)       0
_________________________________________________________________
dropout_3 (Dropout)          (None, 40, 40, 512)       0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 20, 20, 512)       0
_________________________________________________________________
flatten_1 (Flatten)          (None, 204800)            0
_________________________________________________________________
dense_1 (Dense)              (None, 2048)              419432448
_________________________________________________________________
activation_1 (Activation)    (None, 2048)              0
=================================================================
Total params: 420,235,520
Trainable params: 420,235,520
Non-trainable params: 0
_________________________________________________________________
None
Decoder Model
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
layer_2 (Layer)              (None, 2048)              0
_________________________________________________________________
dense_2 (Dense)              (None, 204800)            419635200
_________________________________________________________________
activation_2 (Activation)    (None, 204800)            0
_________________________________________________________________
reshape_1 (Reshape)          (None, 20, 20, 512)       0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 20, 20, 512)       2359808
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 20, 20, 512)       0
_________________________________________________________________
dropout_4 (Dropout)          (None, 20, 20, 512)       0
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 40, 40, 512)       0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 40, 40, 128)       1638528
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 40, 40, 128)       0
_________________________________________________________________
dropout_5 (Dropout)          (None, 40, 40, 128)       0
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 80, 80, 128)       0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 80, 80, 64)        991296
_________________________________________________________________
activation_3 (Activation)    (None, 80, 80, 64)        0
_________________________________________________________________
dropout_6 (Dropout)          (None, 80, 80, 64)        0
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 160, 160, 64)      0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 160, 160, 1)       1601
_________________________________________________________________
activation_4 (Activation)    (None, 160, 160, 1)       0
_________________________________________________________________
dropout_7 (Dropout)          (None, 160, 160, 1)       0
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 320, 320, 1)       0
=================================================================
Total params: 424,626,433
Trainable params: 424,626,433
Non-trainable params: 0
_________________________________________________________________
None
Full Model
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
sequential_1 (Sequential)    (None, 2048)              420235520
_________________________________________________________________
sequential_2 (Sequential)    (None, 320, 320, 1)       424626433
=================================================================
Total params: 844,861,953
Trainable params: 844,861,953
Non-trainable params: 0
_________________________________________________________________
None
PyDev console: starting.
Python 3.6.3 (default, Oct  3 2017, 21:45:48)
[GCC 7.2.0] on linux
