{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Layer",
          "config": {
            "name": "layer_1",
            "trainable": true,
            "batch_input_shape": [
              null,
              320,
              320,
              1
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "filters": 20,
            "kernel_size": [
              11,
              11
            ],
            "strides": [
              2,
              2
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Activation",
          "config": {
            "name": "activation_1",
            "trainable": true,
            "activation": "tanh"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_2",
            "trainable": true,
            "filters": 40,
            "kernel_size": [
              5,
              5
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "name": "leaky_re_lu_1",
            "trainable": true,
            "alpha": 0.20000000298023224
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_2",
            "trainable": true,
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_3",
            "trainable": true,
            "filters": 80,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "name": "leaky_re_lu_2",
            "trainable": true,
            "alpha": 0.20000000298023224
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_3",
            "trainable": true,
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_3",
            "trainable": true,
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "units": 2048,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Activation",
          "config": {
            "name": "activation_2",
            "trainable": true,
            "activation": "sigmoid"
          }
        }
      ]
    },
    {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Layer",
          "config": {
            "name": "layer_2",
            "trainable": true,
            "batch_input_shape": [
              null,
              2048
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "units": 32000,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Activation",
          "config": {
            "name": "activation_3",
            "trainable": true,
            "activation": "sigmoid"
          }
        },
        {
          "class_name": "Reshape",
          "config": {
            "name": "reshape_1",
            "trainable": true,
            "target_shape": [
              20,
              20,
              -1
            ]
          }
        },
        {
          "class_name": "Conv2DTranspose",
          "config": {
            "name": "conv2d_transpose_1",
            "trainable": true,
            "filters": 80,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "padding": "same",
            "data_format": "channels_last",
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "name": "leaky_re_lu_3",
            "trainable": true,
            "alpha": 0.20000000298023224
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_4",
            "trainable": true,
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "Conv2DTranspose",
          "config": {
            "name": "conv2d_transpose_2",
            "trainable": true,
            "filters": 40,
            "kernel_size": [
              5,
              5
            ],
            "strides": [
              2,
              2
            ],
            "padding": "same",
            "data_format": "channels_last",
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "name": "leaky_re_lu_4",
            "trainable": true,
            "alpha": 0.20000000298023224
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_5",
            "trainable": true,
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "Conv2DTranspose",
          "config": {
            "name": "conv2d_transpose_3",
            "trainable": true,
            "filters": 20,
            "kernel_size": [
              11,
              11
            ],
            "strides": [
              2,
              2
            ],
            "padding": "same",
            "data_format": "channels_last",
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "name": "leaky_re_lu_5",
            "trainable": true,
            "alpha": 0.20000000298023224
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_6",
            "trainable": true,
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "Conv2DTranspose",
          "config": {
            "name": "conv2d_transpose_4",
            "trainable": true,
            "filters": 1,
            "kernel_size": [
              5,
              5
            ],
            "strides": [
              2,
              2
            ],
            "padding": "same",
            "data_format": "channels_last",
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "name": "leaky_re_lu_6",
            "trainable": true,
            "alpha": 0.20000000298023224
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_7",
            "trainable": true,
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "Activation",
          "config": {
            "name": "activation_4",
            "trainable": true,
            "activation": "sigmoid"
          }
        }
      ]
    }
  ],
  "keras_version": "2.1.5",
  "backend": "tensorflow"
}